Реализуйте и экспортируйте по умолчанию функцию, которая принимает на вход два отсортированных массива и находит их пересечение.

                                                          Алгоритм:
Поиск пересечения двух неотсортированных массивов — операция, в рамках которой выполняется вложенный цикл с полной проверкой каждого элемента первого массива 
на вхождение во второй.

Сложность данного алгоритма O(n * m) (произведение n и m), где n и m — размерности массивов. Если массивы отсортированы, то можно реализовать алгоритм, 
сложность которого уже O(n + m), что значительно лучше.

Суть алгоритма довольно проста. В коде вводятся два указателя (индекса) на каждый из массивов. 
Начальное значение каждого указателя 0. Затем идёт проверка элементов, находящихся под этими индексами в обоих массивах. 
Если они совпадают, то значение заносится в результирующий массив, а оба индекса инкрементируются. 
Если значение в первом массиве больше, чем во втором, то инкрементируется указатель второго массива, иначе — первого.

const getIntersectionOfSortedArrays = (arr1, arr2) => {
  const result = [];
  let i = 0;
  let j = 0;
  while (i < arr1.length && j < arr2.length) {
    if (arr1[i] === arr2[j]) {
      result.push(arr1[i]);
      i += 1;
      j += 1;
    } else {
      (arr1[i] > arr2[j]) ? j += 1 : i += 1;
    }
  }
  return result;
};

export default getIntersectionOfSortedArrays;
